Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: Close the socket. All future operations on the socket object will fail. The remote end-point will receive no more data (after queued data is flushed). Sockets are automatically closed when they are garbage-collected.
pl: Zamknij gniazdo. Wszystkie przyszłe operacje na gnieździe zawiodą. Odległy koniec nie dostanie więcej danych (po tym jak zakolejkowane dane zostaną przesłane). Gniazda są automatycznie zamykane gdy są poddawane zbieraniu śmieci.

source: A file_dispatcher takes a file descriptor or file object along with an optional map argument and wraps it for use with the :cfunc:`poll` or :cfunc:`loop` functions. If provided a file object or anything with a :cfunc:`fileno` method, that method will be called and passed to the :class:`file_wrapper` constructor. Availability: UNIX.
pl: file_dispatcher pobiera deskryptor pliku lub przedmiot pliku razem z opcjonalnym parametrem mapy i opakowuje go do użycia z zadaniami :cfunc:`poll` lub :cfunc:`loop`. Jeśli dostarczono przedmiot pliku lub cokolwiek ze sposobem postępowania :cfunc:`fileno`, ten sposób postępowania będzie wywołany i przekazany do konstruktora uogólnienia :class:`file_wrapper`. Dostępność: UNIX.

source: A file_wrapper takes an integer file descriptor and calls :func:`os.dup` to duplicate the handle so that the original handle may be closed independently of the file_wrapper. This class implements sufficient methods to emulate a socket for use by the :class:`file_dispatcher` class. Availability: UNIX.
pl: Opakowanie file_wrapper pobiera całkowito-liczbowy deskryptor pliku i wywołuje :func:`os.dup` aby zduplikować uchwyt tak że oryginalny uchwyt może być zamknięty niezależnie od opakowania file_wrapper. To uogólnienie wypełnia wystarczające sposoby postępowania do emulacji gniazda dla użycia przez uogólnienie :class:`file_dispatcher` Dostępność UNIX.

source: asyncore Example basic HTTP client
pl: Podstawowy klient HTTP Przykładu asyncore

source: Here is a very basic HTTP client that uses the :class:`dispatcher` class to implement its socket handling::
pl: Tu jest bardzo podstawowy klient HTTP który używa uogólnienia :class:`dispatcher` do wypełnienia jego obsługi gniazda::

source: import asyncore, socket class http_client(asyncore.dispatcher): def __init__(self, host, path): asyncore.dispatcher.__init__(self) self.create_socket(socket.AF_INET, socket.SOCK_STREAM) self.connect( (host, 80) ) self.buffer = bytes('GET %s HTTP/1.0\r\n\r\n' % path, 'ascii') def handle_connect(self): pass def handle_close(self): self.close() def handle_read(self): print(self.recv(8192)) def writable(self): return (len(self.buffer) > 0) def handle_write(self): sent = self.send(self.buffer) self.buffer = self.buffer[sent:] c = http_client('www.python.org', '/') asyncore.loop()
pl: import asyncore, uogólnienie gniazda http_client(asyncore.dispatcher): def __init__(self, host, path): asyncore.dispatcher.__init__(self) self.create_socket(socket.AF_INET, socket.SOCK_STREAM) self.connect((host, 80) ) self.buffer = bytes('GET %s HTTP/1.0 ' % path, 'ascii') def handle_connect(self): pass def handle_close(self): self.close() def handle_read(self): print(self.recv(8192)) def writable(self): return (len(self.buffer) > 0) def handle_write(self): sent = self.send(self.buffer) self.buffer = self.buffer[sent:] c = http_client('www.python.org', '/') asyncore.loop()

source: :mod:`atexit` --- Exit handlers
pl: :mod:`atexit` --- obsługa Wychodzenia

source: The :mod:`atexit` module defines functions to register and unregister cleanup functions. Functions thus registered are automatically executed upon normal interpreter termination.
pl: moduł :mod:`atexit` definiuje zadania aby zarejestrować i wyrejestrować zadania porządkujące. Zadania tak zarejestrowane są automatycznie wykonywane w momencie normalnego zakończenia programu interpretującego polecenia języka pytonowskiego.

source: Note: the functions registered via this module are not called when the program is killed by a signal, when a Python fatal internal error is detected, or when :func:`os._exit` is called.
pl: Zauważ: zadania zarejestrowane przez ten moduł nie są wywoływane gdy program jest zamykany przez sygnał, lub gdy fatalny wewnętrzny błąd Pythona jest napotykany, ani gdy :func:`os._exit` jest wywoływane.

source: Register *func* as a function to be executed at termination. Any optional arguments that are to be passed to *func* must be passed as arguments to :func:`register`.
pl: Rejestruje *func* jako zadanie do wykonania w momencie zakończenia. Dowolne opcjonalne parametry które mają być przekazane do *funkcji* muszą być przekazywane jako parametry dla zadania :func:`register`.

source: At normal program termination (for instance, if :func:`sys.exit` is called or the main module's execution completes), all functions registered are called in last in, first out order. The assumption is that lower level modules will normally be imported before higher level modules and thus must be cleaned up later.
pl: Przy normalnym zakończeniu programu (dla przykładu, jeśli :func:`sys.exit` jest wywoływana lub zakończy się główne wykonanie modułu), wszystkie zadania zarejestrowane są w porządku "ostatni na wejściu pierwszy na wyjściu". To założenie polega na tym że niższego rzędu moduły będą normalnie importowane przed wyższego rzędu modułami a zatem muszą być sprzątnięte później.

source: If an exception is raised during execution of the exit handlers, a traceback is printed (unless :exc:`SystemExit` is raised) and the exception information is saved. After all exit handlers have had a chance to run the last exception to be raised is re-raised.
pl: Jeśli wyjątek jest zgłaszany w czasie wykonania obsługi wyjścia, wypis wsteczny jest wypisywany (chyba, że :exc:`SystemExit` zostanie zgłoszony) i informacja o wyjątku jest zapisywana. Po tym jak wszystkie obsługujące elementy miały szansę uruchomienia, ostatni wyjątek do zgłoszenia jest zgłaszany-ponownie.

source: This function returns *func* which makes it possible to use it as a decorator without binding the original name to ``None``.
pl: To zadanie zwraca *func* co umożliwia używanie tego jako dekoratora bez podłączania oryginalnej nazwy do ``None`` - z ang. - ``Żaden``.

source: Remove a function *func* from the list of functions to be run at interpreter- shutdown. After calling :func:`unregister`, *func* is guaranteed not to be called when the interpreter shuts down.
pl: Usuń zadanie *func* z listy zadań do uruchomienia w momencie zakończenia działania programu interpretującego polecenia języka pytonowskiego. Po wywołaniu zadania :func:`unregister`, zadanie ma gwarantowane że nie będzie wywoływane gdy program interpretujący polecenia języka pytonowskiego będzie zamykany.

source: Useful example of :mod:`atexit` to read and write :mod:`readline` history files.
pl: Użyteczny przykład modułu :mod:`atexit` do wczytywania i zapisu plików historii :mod:`readline` modułu "czytaj wiersz".

source: :mod:`atexit` Example
pl: Przykład modułu :mod:`atexit`

source: The following simple example demonstrates how a module can initialize a counter from a file when it is imported and save the counter's updated value automatically when the program terminates without relying on the application making an explicit call into this module at termination. ::
pl: Następujący prosty przykład demonstruje jak moduł może inicjować licznik z pliku gdy jest importowany i zapisywać uaktualnioną wartość licznika automatycznie gdy program kończy się bez opierania się na aplikacji wykonującej jawne wywołanie do tego modułu w momencie zakończenia. ::

source: Positional and keyword arguments may also be passed to :func:`register` to be passed along to the registered function when it is called::
pl: Parametry pozycyjny i słowa kluczowego mogą także być przekazane do zadania :func:`register` aby były przekazywane razem do zarejestrowanego zadania gdy jest wywoływane::

source: def goodbye(name, adjective): print('Goodbye, %s, it was %s to meet you.' % (name, adjective)) import atexit atexit.register(goodbye, 'Donny', 'nice') # or: atexit.register(goodbye, adjective='nice', name='Donny')
pl: def goodbye(name, adjective): print('Do zobaczenia, %s, było %s cię widzieć.' % (name, adjective)) import atexit atexit.register(goodbye, 'Danio', 'miło') # or: atexit.register(goodbye, adjective='miło', name='Danio')

source: Usage as a :term:`decorator`::
pl: Użycie jako :term:`decorator`::

source: import atexit @atexit.register def goodbye(): print("You are now leaving the Python sector.")
pl: import atexit @atexit.register def dozobacznia(): print("Opuszczasz teraz sektor pytonowski.")

source: This obviously only works with functions that don't take arguments.
pl: To oczywiście działa tylko z zadaniami które nie pobierają parametrów.

source: :mod:`audioop` --- Manipulate raw audio data
pl: Moduł :mod:`audioop` --- Obsługuj surowe dane dźwiękowe

source: The :mod:`audioop` module contains some useful operations on sound fragments. It operates on sound fragments consisting of signed integer samples 8, 16 or 32 bits wide, stored in Python strings. All scalar items are integers, unless specified otherwise.
pl: Moduł :mod:`audioop` zawiera pewne użyteczne operacje na fragmentach dźwięku. Operuje na fragmentach dźwięku składających się z próbek z liczb całkowitych ze znakiem 8, 16, lub 32 bitowej długości, zapamiętanych w ciągach znaków języka pytonowskiego. Wszystkie skalarne elementy są liczbami całkowitymi, chyba, że określono inaczej.

source: This module provides support for a-LAW, u-LAW and Intel/DVI ADPCM encodings.
pl: Ten moduł dostarcza wsparcia dla kodowania a-LAW, u-LAW i Intel/DVI ADPCM.

source: A few of the more complicated operations only take 16-bit samples, otherwise the sample size (in bytes) is always a parameter of the operation.
pl: Kilka z bardziej skomplikowanych operacji pobiera tylko 16-bitowe próbki, w przeciwnym razie rozmiar próbki (w bajtach - kęsach) jest zawsze parametrem operacji.

source: The module defines the following variables and functions:
pl: Moduł definiuje następujące zmienne i zadania:

source: This exception is raised on all errors, such as unknown number of bytes per sample, etc.
pl: Ten wyjątek jest zgłaszany na wszystkich błędach takich jak nieznana liczba bajtów na próbkę, itp.

source: Return a fragment which is the addition of the two samples passed as parameters. *width* is the sample width in bytes, either ``1``, ``2`` or ``4``. Both fragments should have the same length.
pl: Zwróć fragment, który jest dodaniem dwóch próbek przekazanych jako parametrów. *szerokość* jest szerokością próbki w bajtach, ``1``, ``2`` lub ``4``. Oba fragmenty powinny być tej samej długości.

source: Decode an Intel/DVI ADPCM coded fragment to a linear fragment. See the description of :func:`lin2adpcm` for details on ADPCM coding. Return a tuple ``(sample, newstate)`` where the sample has the width specified in *width*.
pl: Dekoduj fragment zakodowany w Intel/DVI ADPCM do fragmentu liniowego. Zobacz opis zadania :func:`lin2adpcm` dla szczegółów o kodowaniu ADPCM. Zwróć krotkę ``(sample, newstate)`` gdzie sample ma szerokość określoną przez *width*.

source: Convert sound fragments in a-LAW encoding to linearly encoded sound fragments. a-LAW encoding always uses 8 bits samples, so *width* refers only to the sample width of the output fragment here.
pl: Konwertuj fragmenty dźwięku w kodowaniu a-LAW do liniowo zakodowanych fragmentów dźwięku. Kodowanie a-LAW zawsze używa 8-bitowych próbek, więc *width* ( - z ang. - szerokość) odnosi się tylko do szerokości próbki wyjściowego fragmentu tutaj.

source: Return the average over all samples in the fragment.
pl: Zwróć średnią ze wszystkich próbek w tym fragmencie.

source: Return the average peak-peak value over all samples in the fragment. No filtering is done, so the usefulness of this routine is questionable.
pl: Zwróć średnią wartość między-szczytową ponad wszystkimi próbkami w tym fragmencie. Żadne filtrowanie nie jest dokonywane, więc użyteczność tego zadania jest do zakwestionowania.

source: Return a fragment that is the original fragment with a bias added to each sample.
pl: Zwróć fragment który jest oryginalnym fragmentem ze skrzywieniem ( - z ang. - bias ) dodanym do każdej próbki.

source: Return the number of zero crossings in the fragment passed as an argument.
pl: Zwróć liczbę przekroczeń zera we fragmencie przekazanym jako parametr.

source: Return a factor *F* such that ``rms(add(fragment, mul(reference, -F)))`` is minimal, i.e., return the factor with which you should multiply *reference* to make it match as well as possible to *fragment*. The fragments should both contain 2-byte samples.
pl: Zwróć współczynnik *F* taki, że ``rms(dodaj(fragment, mnozenie(odniesienie -F)))`` jest najmniejszy t.j. zwróć czynnik przez który powinno się pomnożyć *odniesienie* aby dopasować jak to się tylko da do *fragmentu*. Fragmenty powinny oba zawierać 2-bajtowe próbki.

source: The time taken by this routine is proportional to ``len(fragment)``.
pl: Czas zabierany przez to zadanie jest proporcjonalny do długości fragmentu ``len(fragment)``.

source: Try to match *reference* as well as possible to a portion of *fragment* (which should be the longer fragment). This is (conceptually) done by taking slices out of *fragment*, using :func:`findfactor` to compute the best match, and minimizing the result. The fragments should both contain 2-byte samples. Return a tuple ``(offset, factor)`` where *offset* is the (integer) offset into *fragment* where the optimal match started and *factor* is the (floating-point) factor as per :func:`findfactor`.
pl: Spróbuj dopasować *odniesienie* tak jak to się tylko da najlepiej do porcji *fragmentu* (która powinna być dłuższym fragmentem). To jest (w teorii) wykonywane przez wyjęcie wycinków z *fragmentu*, użycie zadania :func:`findfactor` aby znaleźć najlepsze dopasowanie, i minimalizując wynik. Fragmenty powinny oba zawierać 2-bajtowe próbki. Zwróć krotkę ``(offset, factor)`` gdzie *offset* jest (całkowitym) przesunięciem wewnątrz *fragmentu* gdzie zaczyna się optymalne dopasowanie, a *factor* jest (zmiennoprzecinkowym) czynnikiem jako dla zadania :func:`findfactor`.

source: Search *fragment* for a slice of length *length* samples (not bytes!) with maximum energy, i.e., return *i* for which ``rms(fragment[i*2:(i+length)*2])`` is maximal. The fragments should both contain 2-byte samples.
pl: Przeszukaj *fragment* w poszukiwaniu wycinka o długości *length* próbek (nie bajtów!) z maksymalną energią, t.j., zwróć *i* dla którego ``rms(fragment[i*2:(i+length)*2])`` jest maksymalne. Fragmenty powinny oba zawierać 2-bajtowe próbki.

source: The routine takes time proportional to ``len(fragment)``.
pl: Zadanie zabiera czas proporcjonalny do długości fragmentu ``len(fragment)``.

source: Return the value of sample *index* from the fragment.
pl: Zwróć wartość próbki spod *indeksu* z danego fragmentu.

source: Convert samples to 4 bit Intel/DVI ADPCM encoding. ADPCM coding is an adaptive coding scheme, whereby each 4 bit number is the difference between one sample and the next, divided by a (varying) step. The Intel/DVI ADPCM algorithm has been selected for use by the IMA, so it may well become a standard.
pl: Zamień sample na kodowanie 4 bitowe Intel/DVI ADPCM. Kodowanie ADPCM jest schematem kodowania adaptacyjnego, gdzie każda 4 bitowa liczba jest różnicą pomiędzy jedną próbką a następną, podzielonym przez (różnej wielkości) krok. Algorytm Intel/DVI ADPCM został wybrany do użycia przez IMA, więc może całkiem prawdopodobnie zostanie on standardem.

source: *state* is a tuple containing the state of the coder. The coder returns a tuple ``(adpcmfrag, newstate)``, and the *newstate* should be passed to the next call of :func:`lin2adpcm`. In the initial call, ``None`` can be passed as the state. *adpcmfrag* is the ADPCM coded fragment packed 2 4-bit values per byte.
pl: *stan* - z ang. *state* - jest krotką zawierającą stan kodera. Koder zwraca krotkę ``(adpcmfrag, nowystan)``, i *nowystan* powinien zostać przekazany do następnego wywołania zadania :func:`lin2adpcm`. W początkowym wywołaniu ``None`` może być przekazane jako stan. *adpcmfrag* jest fragmentem zakodowanym ADPCM zapakowanym dwoma 4-bitowymi wartościami na bajt.

source: Convert samples in the audio fragment to a-LAW encoding and return this as a Python string. a-LAW is an audio encoding format whereby you get a dynamic range of about 13 bits using only 8 bit samples. It is used by the Sun audio hardware, among others.
pl: Zamień próbki we fragmencie dźwięku na kodowanie a-LAW i zwróć wynik jako ciąg znaków języka pytonowskiego. a-LAW jest formatem kodowania dźwięku gdzie dostajesz dynamiczną skalę około 13 bitów używając tylko 8-bitowych próbek. Jest on używany przez sprzęt audio firmy Sun, między innymi.

source: Convert samples between 1-, 2- and 4-byte formats.
pl: Zamień próbki pomiędzy 1-, 2- i 4- bajtowymi formatami.

source: In some audio formats, such as .WAV files, 16 and 32 bit samples are signed, but 8 bit samples are unsigned. So when converting to 8 bit wide samples for these formats, you need to also add 128 to the result::
pl: W pewnych formatach dźwięku, takich jak plikach .WAV, 16 i 32 bitowe próbki są ze znakiem ale 8 bitowe próbki są bez znaku. Więc konwertując 8 bitowe próbki dla tych formatów, potrzeba także dodać 128 do wyniku::

source: The same, in reverse, has to be applied when converting from 8 to 16 or 32 bit width samples.
pl: To samo, odwrócone, musi być stosowane gdy konwertuje się z 8 do 16 lub 32 bitów długości próbek.

source: Convert samples in the audio fragment to u-LAW encoding and return this as a Python string. u-LAW is an audio encoding format whereby you get a dynamic range of about 14 bits using only 8 bit samples. It is used by the Sun audio hardware, among others.
pl: Zamień próbki we fragmencie dźwięku na kodowanie u-LAW i zwróć to jako ciąg znaków języka pytonowskiego. u-LAW jest formatem kodowania dźwięku gdzie dostajesz dynamiczną skalę około 14 bitów używając zaledwie 8-bitowych próbek. Jest używane przez sprzęt dźwiękowy firmy Sun między innymi.

source: Return a tuple consisting of the minimum and maximum values of all samples in the sound fragment.
pl: Zwróć krotkę składającą się z wartości minimum i maksimum ze wszystkich próbek we fragmencie dźwięku.

source: Return the maximum of the *absolute value* of all samples in a fragment.
pl: Zwróć maksimum *wartości bezwzględnej* wszystkich próbek we fragmencie.

source: Return the maximum peak-peak value in the sound fragment.
pl: Zwróć maksimum wartości między-szczytowej we fragmencie dźwięku.

source: Return a fragment that has all samples in the original fragment multiplied by the floating-point value *factor*. Overflow is silently ignored.
pl: Zwróć fragment który ma wszystkie próbki z oryginalnego fragmentu pomnożone przez wartość zmiennoprzecinkową *factor*. Przekroczenie zakresu jest po cichu ignorowane.

source: Convert the frame rate of the input fragment.
pl: Zamień prędkość ramek wejściowego fragmentu.

source: *state* is a tuple containing the state of the converter. The converter returns a tuple ``(newfragment, newstate)``, and *newstate* should be passed to the next call of :func:`ratecv`. The initial call should pass ``None`` as the state.
pl: *stan* ( z ang. - *state*) jest krotką zawierającą stan konwertera. Konwerter zwraca krotkę ``(nowyfragment, nowystan)``, i *nowystan* powinien być przekazany do następnego wywołania zadania :func:`ratecv`. Pierwotne wywołanie powinno przekazać ``None`` jako stan.

source: The *weightA* and *weightB* arguments are parameters for a simple digital filter and default to ``1`` and ``0`` respectively.
pl: *WagaA* i *wagaB* parametry dla prostego filtra cyfrowego i domyślne wartości ``1`` i ``0`` odpowiednio.

source: Reverse the samples in a fragment and returns the modified fragment.
pl: Odwraca próbki we fragmencie i zwraca zmodyfikowany fragment.

source: Return the root-mean-square of the fragment, i.e. ``sqrt(sum(S_i^2)/n)``.
pl: Zwraca rms wartość średnio-kwadratową fragmentu, t.j. ``sqrt(sum(S_i^2)/n)``.

source: This is a measure of the power in an audio signal.
pl: To jest miara mocy w sygnale dźwiękowym.

source: Convert a stereo fragment to a mono fragment. The left channel is multiplied by *lfactor* and the right channel by *rfactor* before adding the two channels to give a mono signal.
pl: Zamień fragment stereo na fragment mono. Lewy kanał jest mnożony przez *lfactor* a prawy kanał przez *rfactor* przed dodaniem obu kanałów które dadzą sygnał mono.

source: Generate a stereo fragment from a mono fragment. Each pair of samples in the stereo fragment are computed from the mono sample, whereby left channel samples are multiplied by *lfactor* and right channel samples by *rfactor*.
pl: Generuj fragment stereo z fragmentu mono. Każda para próbek we fragmencie stereo jest obliczana z próbki mono, gdzie próbki lewego kanału są mnożone przez *lfactor* a prawego kanału przez *rfactor*.

source: Convert sound fragments in u-LAW encoding to linearly encoded sound fragments. u-LAW encoding always uses 8 bits samples, so *width* refers only to the sample width of the output fragment here.
pl: Zamień fragmenty dźwięku w kodowaniu u-LAW na liniowo zakodowane fragmenty dźwięku. Kodowanie u-LAW zawsze używa 8-bitowych próbek, więc *szerokość* odnosi się tylko do szerokości próbki wyjściowego fragmentu tutaj.

source: Note that operations such as :func:`.mul` or :func:`.max` make no distinction between mono and stereo fragments, i.e. all samples are treated equal. If this is a problem the stereo fragment should be split into two mono fragments first and recombined later. Here is an example of how to do that::
pl: Zauważ, że operacje takie jak :func:`.mul` lub :func:`.max` nie czynią żadnych rozróżnień pomiędzy fragmentami mono i stereo, t.j. wszystkie próbki są traktowane na równi. Jeśli jest to problem fragment stereo powinien być podzielony na dwa fragmenty mono wpierw i połączony ponownie później. Tu jest przykład jak to zrobić::

source: If you use the ADPCM coder to build network packets and you want your protocol to be stateless (i.e. to be able to tolerate packet loss) you should not only transmit the data but also the state. Note that you should send the *initial* state (the one you passed to :func:`lin2adpcm`) along to the decoder, not the final state (as returned by the coder). If you want to use :func:`struct.struct` to store the state in binary you can code the first element (the predicted value) in 16 bits and the second (the delta index) in 8.
pl: Jeśli używać kodera ADPCM aby zbudować pakiety sieciowe i chcesz aby twój protokół był bezstanowy (t.j. aby mógł tolerować utratę pakietów) powinieneś nie tylko przesyłać dane ale także stan. Zauważ, że powinieneś przesłać stan *początkowy* (ten który przesłałeś do zadania :func:`lin2adpcm`) do dekodera, nie zaś stan końcowy (jaki zwracał koder). Jeśli chcesz użyć zadania :func:`struct.struct`, aby zachować stan w postaci binarnej możesz zakodować pierwszy element (wartość przewidywaną) w 16 bitach i drugą wartość (delta indeks) w 8.

source: The ADPCM coders have never been tried against other ADPCM coders, only against themselves. It could well be that I misinterpreted the standards in which case they will not be interoperable with the respective standards.
pl: Kodery ADPCM nigdy nie były próbowane naprzeciw innych koderów ADPCM, tylko naprzeciw samym sobie. Może się tak zdarzyć, że nadinterpretowałem standard w którym to przypadku nie będą współpracowały z odpowiadającymi im standardami.
